'use strict';
// Задачи при собесдовании

// 1) Какое будет выведено значение:
//  let x = 5; alert(x++); //? 5

//2) Чему равно такое выражение:
// [] + false - null | true
// console.log(([] + false - null + true)); // "Nan"

//3) Что выведет этот код?
// let y = 1;
// let x = y = 2;
// alert(x); //2

//4)
// console.log([] + 1 + 2); // "12"

//5)
// alert("1"[0]); //1

//6)
// console.log(2 && 1 && null && 0 && undefined); //null 
// И запинается на лжи
// ИЛИ запинается на правде

//7) Есть ли разница между выражениями? 
// console.log(!!(1 && 2) == (1 && 2)); // false

//8) Что выведет этот код ?:
                  //3
// alert(null || 2 && 3 || 4);  //3

//9) 
// const a = [1, 2, 3];
// const b = [1, 2, 3]; //Правда ли что a == b ? //нет (2 разные переменные не равны друг к другу)

// console.log(a == b);
   
// 10) Что выведет этот код:
// alert(+"infinity"); //? infinity тип number

// 11) Верно ли сравнение: "Ёжик" > "яблоко"?
// console.log("Ёжик" > "яблоко"); // не правда нижний регистры выше и буква ё выше чем я

// 12) Чему равно ?
// console.log(0 || "" || 2 || undefined || true || false);

